{nc: 10, depth_multiple: 0.33, width_multiple: 0.5, anchors: [[10, 13, 16, 30, 33,
      23], [30, 61, 62, 45, 59, 119], [116, 90, 156, 198, 373, 326]], backbone: [
    [-1, 1, Conv, [64, 6, 2, 2, 1, true, 0.71875]], [-1, 1, Conv, [128, 3, 2, None,
        1, true, 0.578125]], [-1, 3, C3, [128, true, 1, [0.5, 0.328125], [0.9375,
          1.0, 1.0], 0.5625]], [-1, 1, Conv, [256, 3, 2, None, 1, true, 0.859375]],
    [-1, 6, C3, [256, true, 1, [0.5, 0.484375], [0.78125, 0.234375, 1.0, 1.0, 1.0,
          1.0], 0.9453125]], [-1, 1, Conv, [512, 3, 2, None, 1, true, 0.99609375]],
    [-1, 9, C3, [512, true, 1, [0.5, 0.2890625], [0.9921875, 0.65625, 0.5625, 1.0,
          1.0, 1.0, 1.0, 1.0, 1.0], 0.24609375]], [-1, 1, Conv, [1024, 3, 2, None,
        1, true, 0.21484375]], [-1, 3, C3, [1024, true, 1, [0.5, 0.26953125], [0.7734375,
          1.0, 1.0], 0.345703125]], [-1, 1, SPPF, [1024, 5, 0.1015625]]], head: [
    [-1, 1, Conv, [512, 1, 1, None, 1, true, 0.625]], [-1, 1, nn.Upsample, [None,
        2, nearest]], [[-1, 6], 1, Concat, [1]], [-1, 3, C3, [512, false, 1, [0.5,
          0.1171875], [0.9609375, 1.0, 1.0], 0.76953125]], [-1, 1, Conv, [256, 1,
        1, None, 1, true, 0.234375]], [-1, 1, nn.Upsample, [None, 2, nearest]], [
      [-1, 4], 1, Concat, [1]], [-1, 3, C3, [256, false, 1, [0.5, 0.140625], [0.984375,
          1.0, 1.0], 0.609375]], [-1, 1, Conv, [256, 3, 2, None, 1, true, 0.5234375]],
    [[-1, 14], 1, Concat, [1]], [-1, 3, C3, [512, false, 1, [0.5, 0.34375], [0.9375,
          1.0, 1.0], 0.80859375]], [-1, 1, Conv, [512, 3, 2, None, 1, true, 0.33984375]],
    [[-1, 10], 1, Concat, [1]], [-1, 3, C3, [1024, false, 1, [0.5, 0.462890625], [
          0.84375, 1.0, 1.0], 0.69921875]], [[17, 20, 23], 1, Detect, [nc, anchors]]],
  ch: 3}
