
nc: 10
depth_multiple: 0.33
width_multiple: 0.5

anchors: 
  - [10, 13, 16, 30, 33,23]
  - [30, 61, 62, 45, 59, 119]
  - [116, 90, 156, 198, 373, 326]
  
backbone: 
  [[-1, 1, Conv, [64, 6, 2, 2, 1, true, 0.28125]], 
   [-1, 1, Conv, [128, 3, 2, None, 1, true, 0.875]], 
   [-1, 3, C3, [128, true, 1, [0.5, 0.296875], [0.34375, 1.0, 1.0], 0.890625]], 
   [-1, 1, Conv, [256, 3, 2, None, 1, true, 0.734375]], 
   [-1, 6, C3, [256, true, 1, [0.5, 0.3671875], [0.5, 0.375, 1.0, 1.0, 1.0, 1.0], 0.59375]], 
   [-1, 1, Conv, [512, 3, 2, None, 1, true, 0.2890625]], 
   [-1, 9, C3, [512, true, 1, [0.5, 0.13671875], [0.9453125, 0.5546875, 0.6953125, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0], 0.8125]], 
   [-1, 1, Conv, [1024, 3, 2, None, 1, true, 0.81640625]], 
   [-1, 3, C3, [1024, true, 1, [0.5, 0.25], [0.81640625, 1.0, 1.0], 0.845703125]], 
   [-1, 1, SPPF, [1024, 5, 0.439453125]]
  ]
        
head: 
  [[-1, 1, Conv, [512, 1, 1, None, 1, true, 0.90625]], 
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]], 
   [-1, 3, C3, [512, false, 1, [0.5, 0.30078125], [0.8046875, 1.0, 1.0], 0.6875]], 
   
   [-1, 1, Conv, [256, 1, 1, None, 1, true, 0.8828125]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], 
   [[-1, 4], 1, Concat, [1]], 
   [-1, 3, C3, [256, false, 1, [0.5, 0.171875], [0.796875, 1.0, 1.0], 0.9609375]], 
   
   [-1, 1, Conv, [256, 3, 2, None, 1, true, 0.546875]], 
   [[-1, 14], 1, Concat, [1]], 
   [-1, 3, C3, [512, false, 1, [0.5, 0.40625], [0.5078125, 1.0, 1.0], 0.89453125]],
   
   [-1, 1, Conv, [512, 3, 2, None, 1, true, 0.9921875]], 
   [[-1, 10], 1, Concat, [1]], 
   [-1, 3, C3, [1024, false, 1, [0.5, 0.30078125], [0.3828125, 1.0, 1.0], 0.53125]], 
   
   [[17, 20, 23], 1, Detect, [nc, anchors]],
  ]
