nc: 1
depth_multiple: 0.33
width_multiple: 0.25
anchors: 
  - [10, 13, 16, 30, 33, 23]
  - [30, 61, 62, 45, 59, 119]
  - [116, 90, 156, 198, 373, 326]

backbone: 
 [[-1, 1, Conv, [64, 6, 2, 2, 0.25]],
  [-1, 1, Conv, [128, 3, 2, 0.65625]], 
  [-1, 3, C3, [128, true, 1, [0.5, 0.25], [0.3125, 1.0, 1.0], 0.5]], 
  [-1, 1, Conv,[256, 3, 2, 0.828125]], 
  [-1, 6, C3, [256, true, 1, [0.5, 0.359375], [0.34375,0.40625, 1.0, 1.0, 1.0, 1.0], 0.890625]], 
  [-1, 1, Conv, [512, 3, 2, 0.7265625]],
  [-1, 9, C3, [512, true, 1, [0.5, 0.1796875], [0.296875, 0.21875, 0.5625, 1.0,1.0, 1.0, 1.0, 1.0, 1.0], 0.2265625]], 
  [-1, 1, Conv, [1024, 3, 2, 0.234375]],
  [-1, 3, C3, [1024, true, 1, [0.5, 0.27734375], [0.9921875, 1.0, 1.0], 0.84375]],
  [-1, 1, SPPF, [1024, 5, 0.296875]],
 ] 
    
    
head: 
 [[-1, 1, Conv, [512, 1, 1, 0.90625]],
  [-1, 1, nn.Upsample, [None, 2, 'nearest']], 
  [[-1, 6], 1, Concat, [1]], 
  [-1, 3, C3,[512, false, 1, [0.5, 0.109375], [0.796875, 1.0, 1.0], 0.9375]], 

  [-1, 1, Conv,[256, 1, 1, 0.921875]], 
  [-1, 1, nn.Upsample, [None, 2, 'nearest']], 
  [[-1, 4],1, Concat, [1]], 
  [-1, 3, C3, [256, false, 1, [0.5, 0.421875], [0.59375, 1.0,1.0], 0.5]], 

  [-1, 1, Conv, [256, 3, 2, 0.875]], 
  [[-1, 14], 1, Concat, [1]], 
  [-1, 3, C3, [512, false, 1, [0.5, 0.171875], [0.84375, 1.0, 1.0], 0.3125]],

  [-1, 1, Conv, [512, 3, 2, 0.7734375]], 
  [[-1, 10], 1, Concat, [1]], 
  [-1, 3, C3, [1024, false, 1, [0.5, 0.4296875], [0.375, 1.0, 1.0], 0.51171875]], 

  [[17, 20, 23], 1, Detect, [nc, anchors]]
 ]
