nc: 10
depth_multiple: 0.33
width_multiple: 0.5
anchors: 
  - [10, 13, 16, 30, 33, 23]
  - [30, 61, 62, 45, 59, 119]
  - [116, 90, 156, 198, 373, 326]
      
backbone: 
 [[-1, 1, Conv, [64, 6, 2, 2, 1, true, 0.65625]], 
  [-1, 1, Conv, [128, 3, 2, None, 1, true, 0.9375]], 
  [-1, 3, C3, [128, true, 1, [0.5, 0.46875], [0.53125, 1.0, 1.0], 0.6875]], 
  [-1, 1, Conv, [256, 3, 2, None, 1, true, 0.546875]],
  [-1, 6, C3, [256, true, 1, [0.5, 0.3125], [0.9375, 0.953125, 1.0, 1.0, 1.0, 1.0], 0.9453125]], 
  [-1, 1, Conv, [512, 3, 2, None, 1, true, 0.55859375]],
  [-1, 9, C3, [512, true, 1, [0.5, 0.25390625], [0.9375, 0.3828125, 0.8671875, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0], 0.76953125]], 
  [-1, 1, Conv, [1024, 3, 2, None, 1, true, 0.880859375]], 
  [-1, 3, C3, [1024, true, 1, [0.5, 0.11328125], [0.47265625, 1.0, 1.0], 0.3203125]],
  [-1, 1, SPPF, [1024, 5, 0.259765625]],
 ] 

head: 
 [[-1, 1, Conv, [512, 1, 1, None, 1, true, 0.82421875]], 
  [-1, 1, nn.Upsample, [ None, 2, 'nearest']], 
  [[-1, 6], 1, Concat, [1]], 
  [-1, 3, C3, [512, false, 1, [0.5, 0.375], [0.6171875, 1.0, 1.0], 0.234375]], 
  
  [-1, 1, Conv, [256, 1, 1, None, 1, true, 0.234375]], 
  [-1, 1, nn.Upsample, [None, 2, 'nearest']], 
  [[-1,   4], 1, Concat, [1]], 
  [-1, 3, C3, [256, false, 1, [0.5, 0.4375], [0.40625, 1.0, 1.0], 0.84375]], 

  [-1, 1, Conv, [256, 3, 2, None, 1, true, 0.828125]],
  [[-1, 14], 1, Concat, [1]], 
  [-1, 3, C3, [512, false, 1, [0.5, 0.37890625], [0.40625, 1.0, 1.0], 0.390625]],

  [-1, 1, Conv, [512, 3, 2, None, 1, true, 0.69921875]],
  [[-1, 10], 1, Concat, [1]], 
  [-1, 3, C3, [1024, false, 1, [0.5, 0.275390625], [0.90234375, 1.0, 1.0], 0.712890625]], 
  
  [[17, 20, 23], 1, Detect, [nc, anchors]],
 ]
 
