{nc: 1, depth_multiple: 0.33, width_multiple: 0.25, anchors: [[10, 13, 16, 30, 33,
      23], [30, 61, 62, 45, 59, 119], [116, 90, 156, 198, 373, 326]], backbone: [
    [-1, 1, Conv, [64, 6, 2, 2, 0.9375]], [-1, 1, Conv, [128, 3, 2, 0.90625]], [-1,
      3, C3, [128, true, 1, [0.5, 0.125], [0.5625, 1.0, 1.0], 0.8125]], [-1, 1, Conv,
      [256, 3, 2, 0.703125]], [-1, 6, C3, [256, true, 1, [0.5, 0.34375], [0.71875,
          0.6875, 1.0, 1.0, 1.0, 1.0], 0.625]], [-1, 1, Conv, [512, 3, 2, 0.65625]],
    [-1, 9, C3, [512, true, 1, [0.5, 0.15625], [0.796875, 0.96875, 0.828125, 1.0,
          1.0, 1.0, 1.0, 1.0, 1.0], 0.890625]], [-1, 1, Conv, [1024, 3, 2, 0.6640625]],
    [-1, 3, C3, [1024, true, 1, [0.5, 0.46484375], [0.4453125, 1.0, 1.0], 0.72265625]],
    [-1, 1, SPPF, [1024, 5, 0.16796875]]], head: [[-1, 1, Conv, [512, 1, 1, 0.6796875]],
    [-1, 1, nn.Upsample, [None, 2, nearest]], [[-1, 6], 1, Concat, [1]], [-1, 3, C3,
      [512, false, 1, [0.5, 0.390625], [0.421875, 1.0, 1.0], 0.8515625]], [-1, 1,
      Conv, [256, 1, 1, 0.90625]], [-1, 1, nn.Upsample, [None, 2, nearest]], [[-1,
        4], 1, Concat, [1]], [-1, 3, C3, [256, false, 1, [0.5, 0.328125], [0.84375,
          1.0, 1.0], 0.765625]], [-1, 1, Conv, [256, 3, 2, 0.9375]], [[-1, 14], 1,
      Concat, [1]], [-1, 3, C3, [512, false, 1, [0.5, 0.2109375], [0.90625, 1.0, 1.0],
        0.5078125]], [-1, 1, Conv, [512, 3, 2, 0.8671875]], [[-1, 10], 1, Concat,
      [1]], [-1, 3, C3, [1024, false, 1, [0.5, 0.2578125], [0.7734375, 1.0, 1.0],
        0.5703125]], [[17, 20, 23], 1, Detect, [nc, anchors]]], ch: 3}
